{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_18", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_306", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_306", "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_288", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_288", "inbound_nodes": [[["conv2d_306", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_288", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_288", "inbound_nodes": [[["activation_288", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_307", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_307", "inbound_nodes": [[["batch_normalization_288", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_289", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_289", "inbound_nodes": [[["conv2d_307", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_289", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_289", "inbound_nodes": [[["activation_289", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_308", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_308", "inbound_nodes": [[["batch_normalization_289", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_290", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_290", "inbound_nodes": [[["conv2d_308", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_290", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_290", "inbound_nodes": [[["activation_290", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_309", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_309", "inbound_nodes": [[["batch_normalization_290", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_291", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_291", "inbound_nodes": [[["conv2d_309", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_291", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_291", "inbound_nodes": [[["activation_291", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_54", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_54", "inbound_nodes": [[["batch_normalization_291", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_108", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_108", "inbound_nodes": [[["max_pooling2d_54", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_310", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_310", "inbound_nodes": [[["dropout_108", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_292", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_292", "inbound_nodes": [[["conv2d_310", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_292", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_292", "inbound_nodes": [[["activation_292", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_311", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_311", "inbound_nodes": [[["batch_normalization_292", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_293", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_293", "inbound_nodes": [[["conv2d_311", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_293", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_293", "inbound_nodes": [[["activation_293", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_55", "inbound_nodes": [[["batch_normalization_293", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_109", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_109", "inbound_nodes": [[["max_pooling2d_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_312", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_312", "inbound_nodes": [[["dropout_109", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_294", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_294", "inbound_nodes": [[["conv2d_312", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_294", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_294", "inbound_nodes": [[["activation_294", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_313", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_313", "inbound_nodes": [[["batch_normalization_294", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_295", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_295", "inbound_nodes": [[["conv2d_313", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_295", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_295", "inbound_nodes": [[["activation_295", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_56", "inbound_nodes": [[["batch_normalization_295", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_110", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_110", "inbound_nodes": [[["max_pooling2d_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_314", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_314", "inbound_nodes": [[["dropout_110", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_296", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_296", "inbound_nodes": [[["conv2d_314", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_296", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_296", "inbound_nodes": [[["activation_296", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_315", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_315", "inbound_nodes": [[["batch_normalization_296", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_297", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_297", "inbound_nodes": [[["conv2d_315", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_297", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_297", "inbound_nodes": [[["activation_297", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_54", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_54", "inbound_nodes": [[["batch_normalization_297", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_54", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_54", "inbound_nodes": [[["conv2d_transpose_54", 0, 0, {}], ["batch_normalization_295", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_316", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_316", "inbound_nodes": [[["concatenate_54", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_298", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_298", "inbound_nodes": [[["conv2d_316", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_298", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_298", "inbound_nodes": [[["activation_298", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_317", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_317", "inbound_nodes": [[["batch_normalization_298", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_299", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_299", "inbound_nodes": [[["conv2d_317", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_299", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_299", "inbound_nodes": [[["activation_299", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_111", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_111", "inbound_nodes": [[["batch_normalization_299", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_55", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_55", "inbound_nodes": [[["dropout_111", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_55", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_55", "inbound_nodes": [[["conv2d_transpose_55", 0, 0, {}], ["batch_normalization_293", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_318", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_318", "inbound_nodes": [[["concatenate_55", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_300", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_300", "inbound_nodes": [[["conv2d_318", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_300", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_300", "inbound_nodes": [[["activation_300", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_319", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_319", "inbound_nodes": [[["batch_normalization_300", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_301", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_301", "inbound_nodes": [[["conv2d_319", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_301", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_301", "inbound_nodes": [[["activation_301", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_112", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_112", "inbound_nodes": [[["batch_normalization_301", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_56", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_56", "inbound_nodes": [[["dropout_112", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_56", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_56", "inbound_nodes": [[["conv2d_transpose_56", 0, 0, {}], ["batch_normalization_291", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_320", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_320", "inbound_nodes": [[["concatenate_56", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_302", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_302", "inbound_nodes": [[["conv2d_320", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_302", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_302", "inbound_nodes": [[["activation_302", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_321", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_321", "inbound_nodes": [[["batch_normalization_302", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_303", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_303", "inbound_nodes": [[["conv2d_321", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_303", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_303", "inbound_nodes": [[["activation_303", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_113", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_113", "inbound_nodes": [[["batch_normalization_303", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_322", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_322", "inbound_nodes": [[["dropout_113", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0]], "output_layers": [["conv2d_322", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "batch_normalization_288/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_288/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_288/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_288/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_289/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_289/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_289/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_289/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_291/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_291/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_291/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_291/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_292/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_292/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_292/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_292/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_293/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_293/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_293/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_293/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_294/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_294/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_294/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_294/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_295/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_295/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_295/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_295/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_296/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_296/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_296/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_296/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_297/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_297/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_297/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_297/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_298/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_298/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_298/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_298/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_299/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_299/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_299/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_299/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_300/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_300/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_300/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_300/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_301/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_301/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_301/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_301/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_302/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_302/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_302/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_302/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_303/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_303/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_303/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_303/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_306/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_306/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_307/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_307/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_308/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_308/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_309/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_309/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_310/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_310/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_311/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_311/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_312/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_312/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_313/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_313/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_314/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_314/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_315/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_315/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_316/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_316/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_317/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_317/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_318/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_318/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_319/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_319/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_320/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "conv2d_320/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_321/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_321/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_322/kernel", "shape": [1, 1, 32, 1], "dtype": "float32"}, {"name": "conv2d_322/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose_54/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_54/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_55/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_55/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_56/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_56/bias", "shape": [64], "dtype": "float32"}]}]}
